# taps {{{

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "adoptopenjdk/openjdk"

# }}}

# formulaes {{{

brew "bash"
brew "bash-completion@2"
brew "brew-cask-completion"
brew "curl"
brew "ffmpeg"
brew "freetype"
brew "fzf"
brew "git"
brew "gnu-tar"
brew "golang"
brew "gpg"
brew "htop"
brew "hyperkit"
brew "minikube"
brew "neovim"
brew "nodejs"
brew "python"
brew "ripgrep"
brew "ruby"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "yarn"
brew "yarn-completion"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"

# brew "coreutils"
# brew "findutils"

## kubernetes
# brew "kubectx"

# }}}

# casks {{{

cask "adoptopenjdk"
cask "appcleaner"
cask "brave-browser"
cask "iterm2"
cask "jaxx-liberty"
cask "kodi"
cask "transmission"
cask "visual-studio-code"

# cask "adobe-acrobat-reader"
# cask "balenaetcher"
# cask "multipass"
# cask "spectacle"

# fonts {{{

cask "font-anonymous-pro"
cask "font-awesome-terminal-fonts"
cask "font-clear-sans"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-meslo-lg"
cask "font-nixie-one"
cask "font-office-code-pro"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-ubuntu"

# }}}

# }}}
