####################################################################
# taps
####################################################################

tap "dunn/emacs"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "adoptopenjdk/openjdk"

####################################################################
# formulaes
####################################################################

brew "brew-cask-completion"
brew "bash"
brew "zsh"
brew "coreutils"
brew "git"
brew "vim"
brew "neovim"
brew "curl"
brew "freetype"
brew "gpg"
brew "htop"
brew "tmux"
brew "tree"
brew "unrar"
brew "wget"
brew "fzf"
#brew "findutils"
#brew "youtube-dl"
#brew "gnu-tar"
#brew "jq"

####################################################################
# completions
####################################################################

brew "cargo-completion"
brew "rustc-completion"
brew "zsh-completions"

####################################################################
# casks
####################################################################

cask "adobe-acrobat-reader"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "iterm2"
cask "jaxx-liberty"
cask "kodi"
cask "mpv"
cask "transmission"
cask "adoptopenjdk"
cask "multipass"
#cask "virtualbox"
#cask "virtualbox-extension-pack"
#cask "emacs"
#cask "spectacle"
#cask "vlc"
#cask "visual-studio-code"


####################################################################
# fonts
####################################################################

cask "font-anonymice-powerline"
cask "font-anonymous-pro"
cask "font-awesome-terminal-fonts"
cask "font-clear-sans"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-input"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-lg"
cask "font-monofur-for-powerline"
cask "font-nixie-one"
cask "font-noto-mono-for-powerline"
cask "font-office-code-pro"
cask "font-powerline-symbols"
cask "font-pt-mono"
cask "font-raleway"
cask "font-roboto"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-ubuntu"
cask "font-ubuntu-mono-derivative-powerline"

